# TrussFamilyDiagWebAngleParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyDiagWebAngleParam Property
ParameterTypeId Class See Also
---
"Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyDiagWebAngleParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyDiagWebAngleParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyDiagWebAngleParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace